---
kind: other
id: Methods.T:Autodesk.Revit.DB.Mechanical.DuctLiningType
source: html/e4187df4-df46-d111-6e27-855e5afa26ed.htm
---
# DuctLiningType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.